# Andrew Denman
## wk13: 22 April 2021
### Grouping

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [2]:
#mapping
df = DataFrame({'City':['Alma','Brian Head', 'Fox Park', 'Lake Mary'],
               'Altitude':[10355,9800,9062,8966]})
df

         City  Altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [3]:
st_map = {'Alma':'Colorado','Brian Head':'Utah', 'Fox Park':'Wyoming', 'Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [4]:
df['State'] = df['City'].map(st_map)
df

         City  Altitude       State
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [5]:
#apply
def meter(x):
    return x/ 3.2808

In [6]:
df['Altitude'] = df['Altitude'].apply(meter)
df

         City     Altitude       State
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [7]:
df = DataFrame(np.random.randn(4,3), columns = list('bde'),
              index = ['UT', 'OH', 'TX', 'OR'])
df

           b         d         e
UT -0.932547 -0.687973 -0.129097
OH -0.538702  0.931223 -0.054343
TX -0.858000 -0.985438 -1.590740
OR  0.066685  0.037491  0.893343

In [8]:
def dif(x):
    return x.max() - x.min()

In [9]:
df.apply(dif)

b    0.999233
d    1.916661
e    2.484083
dtype: float64

In [10]:
df.apply(dif, axis  =1)

UT    0.803450
OH    1.469925
TX    0.732740
OR    0.855852
dtype: float64

In [11]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.590740  0.0  0.0  1.0
-0.985438  0.0  1.0  0.0
-0.932547  1.0  0.0  0.0
-0.858000  1.0  0.0  0.0
-0.687973  0.0  1.0  0.0
-0.538702  1.0  0.0  0.0
-0.129097  0.0  0.0  1.0
-0.054343  0.0  0.0  1.0
 0.037491  0.0  1.0  0.0
 0.066685  1.0  0.0  0.0
 0.893343  0.0  0.0  1.0
 0.931223  0.0  1.0  0.0

In [14]:
#Group by
df = DataFrame({'k1': ['a','a','b','b','c'],
                'k2': ['one','two', 'one', 'two', 'one'],
                'dataset1': np.random.randn(5),
                'dataset2': np.random.randn(5)})
df

  k1   k2  dataset1  dataset2
0  a  one -0.456622  1.721522
1  a  two  0.901841  1.873455
2  b  one -0.166766 -0.118456
3  b  two  0.145590  0.075588
4  c  one -0.406229  0.953404

In [15]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [16]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [17]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [18]:
df

  k1   k2  dataset1  dataset2
0  a  one -0.456622  1.721522
1  a  two  0.901841  1.873455
2  b  one -0.166766 -0.118456
3  b  two  0.145590  0.075588
4  c  one -0.406229  0.953404

In [19]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    0.222610
b   -0.010588
c   -0.406229
Name: dataset1, dtype: float64

In [20]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.222610  1.797489
b  -0.010588 -0.021434
c  -0.406229  0.953404

In [21]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one -0.456622  1.721522
   two  0.901841  1.873455
b  one -0.166766 -0.118456
   two  0.145590  0.075588
c  one -0.406229  0.953404

In [23]:
group = df.groupby(['k1','k2'])[['dataset1']]

group.mean()

        dataset1
k1 k2
a  one -0.456622
   two  0.901841
b  one -0.166766
   two  0.145590
c  one -0.406229